# YOLOv8m + EMA at P4 only — width_multiple=0.664 轻量化版
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.664, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12 P4_up
  - [-1, 1, EMA, [32]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15
  - [-1, 3, C2f, [256]] # 16 P3

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, Concat, [1]] # 18
  - [-1, 3, C2f, [512]] # 19 P4_down
  - [-1, 1, EMA, [32]] # 20

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 9], 1, Concat, [1]] # 22
  - [-1, 3, C2f, [1024]] # 23 P5

  - [[16, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
